message.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://server.soap.adi.adpter.cmsgw.ums.huawei.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns0:Body><ns1:notify><ns1:notifyRequest><ns1:MD5CcheckSum /><ns1:NO xsi:nil="true" /><ns1:URL xsi:nil="true" /></ns1:notifyRequest></ns1:notify></ns0:Body></ns0:Envelope><ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://server.soap.adi.adpter.cmsgw.ums.huawei.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns0:Body><ns1:notify><ns1:notifyRequest><ns1:MD5CcheckSum /><ns1:NO xsi:nil="true" /><ns1:URL xsi:nil="true" /></ns1:notifyRequest></ns1:notify></ns0:Body></ns0:Envelope>